run/flow_wave/0/epsilon.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 2 -3 0 0 0 0];

internalField   uniform 0.3864;

boundaryField
{
    wall
    {
        type            epsilonWallFunction;
        value           uniform 0.3864;
    }
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    1.8e-4;
        value           uniform 0.3864;
    }
    outOrIn
    {
        type            inletOutlet;
        inletValue      uniform 0.3864;
        value           uniform 0.3864;
    }
    frontAndBack
    {
        type            empty;
    }
}


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
