run/flow_wave/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
70950
(
101321.161271
101321.104817
101321.024871
101320.954078
101320.877694
101320.795746
101320.708253
101320.615229
...
)
;

boundaryField
{
    top
    {
        type            prghTotalHydrostaticPressure;
        value           uniform 0;
    }
    axis
    {
        type            prghTotalHydrostaticPressure;
        value           uniform 0;
    }
    side
    {
        type            prghTotalHydrostaticPressure;
        value           uniform 0;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    groundAndWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
3880
(
101321.175976
101321.175273
101321.174592
101321.173909
101321.173225
101321.172608
101321.173022
101321.173435
...
)
;
    }
    nozzel
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
36
(
101321.173473
101321.173475
101321.173475
101321.173474
101321.173474
101321.173474
101321.173475
101321.173475
...
)
;
    }
    inlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
